---
kind: type
id: T:Autodesk.Revit.DB.Architecture.StairsTextOrientation
source: html/6825f568-2bac-7041-0a48-1cb16713da1a.htm
---
# Autodesk.Revit.DB.Architecture.StairsTextOrientation

The options to be used when orienting text annotations relative to stairs.

## Syntax (C#)
```csharp
public enum StairsTextOrientation
```